README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-02 Sun 09:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Rakandhiya Daanii Rachmanto" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1c746ba">1. Pruning Experimentation</a>
<ul>
<li><a href="#orgc6ac47f">1.1. Project Dependencies</a></li>
<li><a href="#orgb96f0e6">1.2. Training Base Model</a></li>
<li><a href="#org87c2d18">1.3. Pruning</a></li>
<li><a href="#org5f7887c">1.4. Characterization</a>
<ul>
<li><a href="#org761ab21">1.4.1. Latency</a></li>
<li><a href="#orgcb6769f">1.4.2. Accuracy</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1c746ba" class="outline-2">
<h2 id="org1c746ba"><span class="section-number-2">1.</span> Pruning Experimentation</h2>
<div class="outline-text-2" id="text-1">
<p>
This repo is an archive for experiments exploring model pruning. One of the common ways of compressing AI models. 
</p>
</div>

<div id="outline-container-orgc6ac47f" class="outline-3">
<h3 id="orgc6ac47f"><span class="section-number-3">1.1.</span> Project Dependencies</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If using <code>poetry</code>, the dependencies and respective versions are stated in <code>pyproject.toml</code>. For pip, see <code>requirements.txt</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash"># If using poetry
poetry install

# If using pip
pip install -r requirements.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb96f0e6" class="outline-3">
<h3 id="orgb96f0e6"><span class="section-number-3">1.2.</span> Training Base Model</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Execute this script to train a base (unpruned) model:
</p>

<div class="org-src-container">
<pre class="src src-bash">python3 train.py --dataset Flowers102 --model mobilenet_v3_small --epochs 8 --batch-size 8 --save-as full --save-path ./models/mobilenet_v3_small-Flowers102-1.pth
</pre>
</div>

<p>
Numerous options are available to control for the training process:
</p>
<ul class="org-ul">
<li><code>--dataset</code>: Which dataset to use, currently only <code>Flowers102</code> is supported.</li>
<li><p>
<code>--model</code>: Which CNN or Transformer-based model to train. See <code>config.py</code> for examples of how to refer to the model to use. Currently 7 models are supported:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Model Name</th>
<th scope="col" class="org-left">argument</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MobileNetV3Small</td>
<td class="org-left"><code>mobilenet_v3_small</code></td>
</tr>

<tr>
<td class="org-left">MobileNetV3Large</td>
<td class="org-left"><code>mobilenet_v3_large</code></td>
</tr>

<tr>
<td class="org-left">EfficientNetB1</td>
<td class="org-left"><code>efficientnet_b1</code></td>
</tr>

<tr>
<td class="org-left">EfficientNetB3</td>
<td class="org-left"><code>efficientnet_b3</code></td>
</tr>

<tr>
<td class="org-left">DenseNet169</td>
<td class="org-left"><code>densenet169</code></td>
</tr>

<tr>
<td class="org-left">DenseNet201</td>
<td class="org-left"><code>densenet201</code></td>
</tr>

<tr>
<td class="org-left">ViT B16</td>
<td class="org-left"><code>vit_b_16</code></td>
</tr>
</tbody>
</table></li>
</ul>


<ul class="org-ul">
<li><code>--epochs</code>: How many epochs are the network is trained for. Defaults to 32.</li>
<li><code>--batch-size</code>: How many images in one batch. Used to split the train and test set.</li>
<li><code>--save-as</code>: The <code>torch.save()</code> configuration to use. Options are state-dict, or full. State-dict will save the weights, whereas full will save the whole model</li>
<li><code>--save-path</code>: Where to save the trained model.</li>
</ul>

<p>
Bash script (available as <code>train.sh</code>) is available for automation, the above configurable option is editable inside the bash script, below is an example on how to execute the bash script in the background:
</p>

<div class="org-src-container">
<pre class="src src-bash">chmod +x ./train.sh
nohup ./train.sh &amp;
</pre>
</div>
</div>
</div>

<div id="outline-container-org87c2d18" class="outline-3">
<h3 id="org87c2d18"><span class="section-number-3">1.3.</span> Pruning</h3>
<div class="outline-text-3" id="text-1-3">
<p>
To prune, execute the following:
</p>

<div class="org-src-container">
<pre class="src src-bash">python3 prune.py --path models/mobilenet_v3_small-Flowers102-1.pth --layer-kind Complete --pruning-method L1Unstructured --amount 0.8 --global-unstructured --check-percentage
</pre>
</div>

<p>
The arguments for this script is as follows:
</p>
<ul class="org-ul">
<li><code>--path</code>: Location of the .pth file containing the full model to prune.</li>
<li><code>--layer-kind</code>: What layers to prune, available options are Linear, Conv2d, or Complete (selecting both Linear and Conv2d).</li>
<li><code>--pruning-method</code>: Which pruning method to use. Currently two are supported: <code>RandomUnstructured</code>, <code>L1Unstructured</code>.</li>
<li><code>--amount</code>: How much of the model is going to be pruned. Setting this to 0.5 is equivalent to pruning to 50%.</li>
<li><code>--global-unstructured</code>: Set this flag to utilize global unstructured pruning. ALWAYS ENABLE THIS FLAG FOR NOW!</li>
<li><code>--check-percentage</code>: Set this flag to see exact numbers of parameters being pruned in each layer.</li>
</ul>
</div>
</div>

<div id="outline-container-org5f7887c" class="outline-3">
<h3 id="org5f7887c"><span class="section-number-3">1.4.</span> Characterization</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org761ab21" class="outline-4">
<h4 id="org761ab21"><span class="section-number-4">1.4.1.</span> Latency</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
To benchmark latency, first, download the following <a href="https://drive.google.com/drive/folders/15mw-dg2lIo0z_AnMbqxBDkf1HFaORXgF?usp=sharing">Bromelia</a> and place the contents (files called image_..) inside the <code>inference/</code> directory. the command to run is:
</p>

<div class="org-src-container">
<pre class="src src-bash">python3 -m benchmark.lat-check --model efficientnet_b1 --path ./models/efficientnet_b1-Flowers102-1.pth
</pre>
</div>

<p>
Arguments:
</p>
<ul class="org-ul">
<li><code>--model</code>: Which model is being tested for latency. This argument is used to select the appropriate preprocessing pipeline to use for the training and test set.</li>
<li><code>--path</code>: Path to the .pth file of the model to test.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb6769f" class="outline-4">
<h4 id="orgcb6769f"><span class="section-number-4">1.4.2.</span> Accuracy</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
To benchmark accuracy, execute the following script:
</p>

<div class="org-src-container">
<pre class="src src-bash">python3 -m benchmark.acc-check --model mobilenet_v3_small --dataset Flowers102 --batch-size 8 --path ./models/mobilenet_v3_small-Flowers102-1.pth
</pre>
</div>

<p>
Arguments:
</p>
<ul class="org-ul">
<li><code>--model</code>: Which model is being tested for accuracy. This argument is used to select the appropriate preprocessing pipeline to use for the training and test set.</li>
<li><code>--dataset</code>: Which dataset to use.</li>
<li><code>--batch-size</code>: How many images per batch.</li>
<li><code>--path</code>: Path to the .pth file of the model to test.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rakandhiya Daanii Rachmanto</p>
<p class="date">Created: 2024-06-02 Sun 09:30</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
